Repository: plone/plone.restapi
Catalog: src/plone/restapi/locales/*/LC_MESSAGES/plone.restapi.po
Languages: es, fr, pt_br

source: ${sender_fullname} via ${portal_title}
es: ${sender_fullname} vía ${portal_title}

source: A portal user via ${portal_title}
es: Un usuario de portal user vía ${portal_title}
fr: Un utilisateur du portail via ${portal_title}
pt_br: Um usuário do portal via ${portal_title}

source: Adds sample content for performance testing
es: Añadir contenido de ejemplo para efectuar pruebas
pt_br: Adiciona conteúdo de amostra para teste de desempenho

source: Adds sample content types for testing
es: Añadir tipos de contenido de ejemplo para pruebas
pt_br: Adiciona tipos de conteúdo de amostra para teste

source: Adds sample workflows for testing
es: Añadir flujos de trabajo de muestra para realizar pruebas
pt_br: Adiciona workflows de amostra para teste

source: Alternative urls that point to themselves will cause an endless cycle of redirects.
es: Las URL alternativas que apuntan a sí mismas provocarán un bucle interminable de redireccionamientos.
fr: Les URLs alternatives qui pointent vers elles-mêmes provoqueront un cycle sans fin de redirections.
pt_br: URLs alternativas que apontam para si mesmas causarão um ciclo interminável de redirecionamentos.

source: Blocks
es: Bloques
fr: Blocs
pt_br: Blocos

source: Blocks (Editable Layout)
es: Bloques (Diseño editable)
fr: Blocs (mise en page modifiable)
pt_br: Blocos (Layout Editável)

source: Enables Volto Blocks (editable layout) support
es: Habilita el soporte para bloques Volto (diseño editable)
fr: Active la prise en charge des blocs Volto (mise en page modifiable)
pt_br: Habilita o suporte a Blocos Volto (layout editável)

source: Enables Volto Blocks support
es: Habilitar soporte a Bloques Volto
fr: Active la prise en charge des blocs Volto
pt_br: Habilita o suporte a Blocos Volto

source: Enables blocks on the Document content type
es: Habilitar bloques en el tipo de contenido Documento
pt_br: Habilita blocos no tipo de conteúdo Página

source: Enter a valid scale name (see 'Image Handling' control panel) to override (e.g. icon, tile, thumb, mini, preview, ... ). Leave empty to use default (see 'Site' control panel).
es: Introducir un nombre de escala válido (consulte 'Manipulación de imágenes' en el panel de control) para anular (por ejemplo, icon, tile, thumb, mini, preview...). Déjelo en blanco para usar el valor predeterminado (consulte 'Sitio' en el panel de control).
fr: Saisissez un nom d'échelle valide (cf. « Gestion des images » dans le panneau de configuration) pour outrepasser (p. ex. icon, tile, thumb, mini, preview, etc.). Laisser vide pour utiliser les échelles par défaut (cf. « Site » dans le panneau de configuration).
pt_br: Informe um nome de escala válido (ver 'Manipulação de Imagem' no painel de controle) para sobrescrever (por exemplo, icon, tile, thumb, mini, preview…). Deixe em branco para usar o valor padrão (ver 'Site' no painel de controle).

source: Error in fields. ${errors_to_string}
es: Errores en los campos. ${errors_to_string}
fr: Erreur dans les champs. ${errors_to_string}
pt_br: Erros em campos. ${errors_to_string}

source: Expired Token
es: Token caducado
fr: Le reset_token a expiré
pt_br: Token Expirádo

source: If enabled, the portlet will not show document type icons.
es: Si está habilitado, el portlet no mostrará los iconos de tipo de contenido.
fr: Si activé, le portlet n'affichera pas les icônes de types de documents.
pt_br: Caso ativado, o portlet não mostrará os ícones do tipo de conteúdo

source: If enabled, the portlet will not show thumbs.
es: Si está habilitado, el portlet no mostrará miniaturas.
fr: Si activé, le portlet n'affichera pas les miniatures.
pt_br: Caso ativado, o portlet não mostrará miniaturas.

source: If you pass 'old_password' you have to pass 'new_password'
es: Si introduce 'Contraseña anterior', debe ingresar 'Contraseña nueva'
fr: Si vous passez le paramètre 'old_password' vous devez passer le paramètre 'new_password'
pt_br: Se você informar 'Senha Antiga', você deve informar 'Nova Senha'

source: If you pass 'reset_token' you have to pass 'new_password'
es: Si introduce 'Restablecer token' debe ingresar 'Nueva contraseña'
fr: Si vous passez le paramètre 'reset_token', vous devez passer le paramètre 'new_password'
pt_br: Se você informar 'Redefinir Token' você deve informar 'Nova Senha'

source: Layout
es: Diseño
fr: Mise en page

source: Navigation
es: Navegación
pt_br: Navegação

source: Override thumb scale
es: Anular escala de miniaturas
fr: Remplacer l'échelle de miniature
pt_br: Sobrescrever a escala da miniatura

source: Property '${fieldname}' is not allowed.
es: El campo '${fieldname}' no está permitido.
fr: La propriété '${fieldname}' n'est pas autorisée.
pt_br: Campo '${fieldname}' não é permitido.

source: Property '${fieldname}' is required.
es: El campo '${fieldname}' es obligatorio.
fr: La propriété '${fieldname}' est obligatoire.
pt_br: Campo '${fieldname}' é obrigatório.

source: RESTful hypermedia API for Plone - Uninstall
es: API hipermedia RESTful para Plone - Desinstalar
pt_br: RESTful hypermedia API para Plone - Desinstalar

source: RESTful hypermedia API for Plone.
es: API hipermedia RESTful para Plone.
pt_br: RESTful hypermedia API para Plone

source: Reverted to revision ${version}
es: Revertido para revisión ${version}
fr: Retour à la révision ${version}
pt_br: Revertido para revisão ${version}

source: See the user endpoint documentation for the valid parameters.
es: Consulte la documentación del usuario del terminal para conocer los parámetros válidos.
fr: Consultez la documentation du endpoint user pour les paramètres valides.
pt_br: Consulte a documentação do endpoint user para obter os parâmetros válidos.

source: Suppress Icons
es: Suprimir iconos
fr: Supprimer les icônes
pt_br: Suprimir ícones

source: Suppress thumbs
es: Suprimir miniaturas
fr: Supprimer les miniatures
pt_br: Suprimir miniaturas

source: The password passed as 'old_password' is wrong.
es: La contraseña pasada como "Contraseña anterior" no es válida.
fr: Le mot de passe passé comme 'old_password' est erroné.
pt_br: A Senha passada como 'Senha Antiga' não é válida.

source: The reset_token is unknown/not valid.
es: El reset_token es desconocido/no válido.
fr: Le reset_token est inconnu/non valide.
pt_br: O reset_token é desconhecido/inválido.

source: Volto Blocks
es: Bloques Volto
fr: Blocs Volto
pt_br: Blocos Volto

source: You are not authorized to perform this action
es: No está autorizado a realizar esta acción.
fr: Vous n'êtes pas autorisé à effectuer cette action
pt_br: Você não está autorizado a realizar esta ação

source: You are receiving this mail because ${sender_fullname} sent this message via the site ${portal_title}:
es: Está recibiendo este correo porque ${sender_fullname} envió este mensaje a través del sitio ${portal_title}:
fr: Vous recevez cette e-mail, car ${sender_fullname} vous a envoyé ce message depuis ${portal_title}:
pt_br: Você está recebendo este e-mail porque ${sender_fullname} enviou esta mensagem através do site ${portal_title}:

source: You can't send both password and sendPasswordReset.
es: No puede enviar la contraseña y 'Enviar un correo electrónico de confirmación con un enlace para establecer la contraseña'.
fr: Vous ne pouvez pas envoyer à la fois le password et sendPasswordReset
pt_br: Você não pode informar Senha e 'Envie um e-mail de confirmação com um link para definir a senha'.

source: You can't set a password without a password reset token.
es: No puede establecer una contraseña sin un token de restablecimiento de contraseña.
fr: Vous ne pouvez pas définir de mot de passe sans un jeton de réinitialisation de mot de passe.
pt_br: Você não pode definir uma senha sem um token de redefinição de senha.

source: You can't update the properties of this user
es: No puede actualizar las propiedades de este usuario.
fr: Vous ne pouvez pas mettre à jour les propriétés de cet utilisateur
pt_br: Você não pode atualizar as propriedades deste usuário

source: You can't use 'reset_token' and 'old_password' together.
es: No puede utilizar 'Restablecer token' y 'Contraseña anterior' juntas.
fr: Vous ne pouvez pas utiliser 'reset_token' et 'old_password' ensemble.
pt_br: Você não pode usar 'Redefinir Token' e 'Senha Antiga' juntos.

source: You have to either send a password or sendPasswordReset.
es: Debe enviar una contraseña o 'Enviar un correo electrónico de confirmación con un enlace para establecer la contraseña'.
fr: Vous devez soit saisir un password ou sendPasswordReset
pt_br: Você deve informar uma Senha ou 'Envie um e-mail de confirmação com um link para definir a senha'.

source: You need AddPortalMember permission.
es: Necesita el permiso AddPortalMember.
fr: Vous avez besoin de la permission AddPortalMember
pt_br: Você precisa da permissão AddPortalMember.

source: You need to be logged in as the user '${username}' to set the password.
es: Debe iniciar sesión como usuario '${username}' para poder establecer la contraseña.
fr: Vous devez être connecté an tant que '${username}' pour définir le mot de passe.
pt_br: Você precisa estar logado como o usuário '${username}' para definir a senha.

source: dependency_missing
es: Dependencia faltante
fr: Dépendence manquante
pt_br: Dependência ausente

source: help_current_folder_only
es: Si se selecciona, el árbol de navegación siempre mostrará solo la carpeta actual y sus hijos.
fr: Si cette option est sélectionnée, l'arborescence de navigation n'affichera à tout moment que le dossier actuel et ses enfants.
pt_br: Caso selecionado, a árvore de navegação irá sempre mostrar somente a pasta atual e seus filhos.

source: help_include_top_node
es: Si el nodo superior, o 'raíz', debe mostrarse o no en el árbol de navegación. Esto se ve afectado por la configuración del 'Nivel inicial'.
fr: Afficher ou non le nœud supérieur ou 'racine' dans l'arborescence de navigation. Ceci est affecté par le paramètre 'Niveau de démarrage'.
pt_br: Se o nodo topo, ou 'raiz', deve ser ou não exibido na árvore de navegação. Isso é afetado pela configuração do 'Nível inicial'.

source: help_navigation_root
es: Puede buscar y seleccionar una carpeta para que actúe como raíz del árbol de navegación. Déjelo en blanco para usar la raíz del sitio Plone.
fr: Vous pouvez rechercher et choisir un dossier qui servira de racine à l'arborescence de navigation. Laissez vide pour utiliser la racine du site Plone.
pt_br: Você pode procurar por e selecionar uma pasta para agir como a raiz da árvore de navegação. Deixe em branco para usar a raiz do site Plone.

source: help_navigation_start_level
es: Un valor entero que especifica el número de niveles de carpeta debajo de la raíz del sitio que se deben exceder antes de que se muestre el árbol de navegación. 0 significa que el árbol de navegación debe mostrarse en cualquier lugar, incluidas las páginas en la raíz del sitio. 1 significa que el árbol solo aparecerá dentro de las carpetas ubicadas en la raíz y debajo de ella, y nunca aparecerá en el nivel raíz.
fr: Une nombre entière qui spécifie le nombre de niveaux de dossier sous la racine du site qui doit être dépassé avant que l'arborescence de navigation s'affiche. 0 signifie que l'arborescence de navigation doit être affichée partout, en ce compris les pages à la racine du site. 1 signifie que l'arborescence n'apparaît qu'à l'intérieur des dossiers situés à la racine et en dessous, sans jamais s'afficher au niveau supérieur.
pt_br: Um valor inteiro que especifica o número de níveis de pastas abaixo da raiz do site que deve ser excedido antes que a árvore de navegação seja mostrada. 0 significa que a árvore de navegação deve ser mostrada em qualquer lugar, incluindo páginas na raiz do site. 1 significa que a árvore somente aparecerá dentro de pastas localizadas na raiz e abaixo delas, nunca aparecendo no nível raiz.

source: help_navigation_title
es: El título del árbol de navegación.
fr: Titre de l'arborescence de navigation.
pt_br: O título da árvore de navegação.

source: help_navigation_tree_depth
es: Cuántas carpetas se deben incluir antes de que se detenga el árbol de navegación. 0 significa sin límite. 1 significa incluir solo la carpeta raíz.
fr: Combien de dossiers doivent être inclus avant que l'arborescence de navigation ne s'arrête. 0 signifie aucune limite. 1 inclut uniquement le dossier racine.
pt_br: Quantas pastas devem ser incluídas antes que a árvore de navegação pare. 0 significa sem limite. 1 significa incluir somente a pasta raiz.

source: label_current_folder_only
es: Muestra solo el contenido de la carpeta actual.
fr: Afficher uniquement le contenu du dossier actuel.
pt_br: Apenas exibir o conteúdo da pasta atual.

source: label_include_top_node
es: Incluir nodo superior
fr: Inclure le nœud supérieur
pt_br: Incluir o nodo topo

source: label_navigation_root_path
es: Nodo raíz
fr: Noeud principal
pt_br: Nodo raiz

source: label_navigation_startlevel
es: Nivel inicial
fr: Niveau de démarrage
pt_br: Nível inicial

source: label_navigation_title
es: Título
fr: Titre
pt_br: Título

source: label_navigation_tree_depth
es: Profundidad del árbol de navegación
fr: Profondeur de l'arborescence de navigation
pt_br: Profundidade da árvore de navegação

source: plone.restapi performance testing
es: plone.restapi - prueba de rendimiento
pt_br: plone.restapi teste de performance

source: plone.restapi testing
es: plone.restapi - pruebas
pt_br: teste plone.restapi

source: plone.restapi testing-workflows
es: plone.restapi - pruebas de flujos de trabajo

source: Roles
fr: Rôles
pt_br: Papéis
